{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0ef7ddfa",
   "metadata": {},
   "source": [
    "Задание_1. Напишите программу, которая выводит таблицу умножения от 1 до 10."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "2b803927",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\t2\t3\t4\t5\t6\t7\t8\t9\t10\t\n",
      "2\t4\t6\t8\t10\t12\t14\t16\t18\t20\t\n",
      "3\t6\t9\t12\t15\t18\t21\t24\t27\t30\t\n",
      "4\t8\t12\t16\t20\t24\t28\t32\t36\t40\t\n",
      "5\t10\t15\t20\t25\t30\t35\t40\t45\t50\t\n",
      "6\t12\t18\t24\t30\t36\t42\t48\t54\t60\t\n",
      "7\t14\t21\t28\t35\t42\t49\t56\t63\t70\t\n",
      "8\t16\t24\t32\t40\t48\t56\t64\t72\t80\t\n",
      "9\t18\t27\t36\t45\t54\t63\t72\t81\t90\t\n",
      "10\t20\t30\t40\t50\t60\t70\t80\t90\t100\t\n"
     ]
    }
   ],
   "source": [
    "n = 10\n",
    "for i in range(1, n + 1):\n",
    "  for j in range(1, n + 1):\n",
    "    print(i * j, end='\\t')\n",
    "  print()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a8603798",
   "metadata": {},
   "source": [
    "Задание_2. Шахматная доска. Напишите программу для создания шахматной доски с помощью символов. Каждая клетка доски должна быть представлена пробелом или символом \"#\" для создания шахматной сетки."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "c3be1cff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите размерность шахматной доски (NxN):\n",
      "8\n",
      "#   #   #   #   \n",
      "  #   #   #   # \n",
      "#   #   #   #   \n",
      "  #   #   #   # \n",
      "#   #   #   #   \n",
      "  #   #   #   # \n",
      "#   #   #   #   \n",
      "  #   #   #   # \n"
     ]
    }
   ],
   "source": [
    "print('Введите размерность шахматной доски (NxN):')\n",
    "n = int(input())\n",
    "for i in range(1, n + 1):\n",
    "  for j in range(1, n + 1):\n",
    "    if (i + j) % 2 == 0:\n",
    "      print('#', end=' ')\n",
    "    else:\n",
    "      print(' ', end=' ')\n",
    "  print()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fce29901",
   "metadata": {},
   "source": [
    "Задание_3. Найти количество делителей каждого из целых чисел от 120 до 140."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "07def6a7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Для числа 120 найдено следующее кол-во делителей: 15\n",
      "Для числа 121 найдено следующее кол-во делителей: 2\n",
      "Для числа 122 найдено следующее кол-во делителей: 3\n",
      "Для числа 123 найдено следующее кол-во делителей: 3\n",
      "Для числа 124 найдено следующее кол-во делителей: 5\n",
      "Для числа 125 найдено следующее кол-во делителей: 3\n",
      "Для числа 126 найдено следующее кол-во делителей: 11\n",
      "Для числа 127 найдено следующее кол-во делителей: 1\n",
      "Для числа 128 найдено следующее кол-во делителей: 7\n",
      "Для числа 129 найдено следующее кол-во делителей: 3\n",
      "Для числа 130 найдено следующее кол-во делителей: 7\n",
      "Для числа 131 найдено следующее кол-во делителей: 1\n",
      "Для числа 132 найдено следующее кол-во делителей: 11\n",
      "Для числа 133 найдено следующее кол-во делителей: 3\n",
      "Для числа 134 найдено следующее кол-во делителей: 3\n",
      "Для числа 135 найдено следующее кол-во делителей: 7\n",
      "Для числа 136 найдено следующее кол-во делителей: 7\n",
      "Для числа 137 найдено следующее кол-во делителей: 1\n",
      "Для числа 138 найдено следующее кол-во делителей: 7\n",
      "Для числа 139 найдено следующее кол-во делителей: 1\n"
     ]
    }
   ],
   "source": [
    "for i in range(120, 140):\n",
    "  k = 0\n",
    "  for j in range(1, i):\n",
    "    if i % j == 0:\n",
    "      k = k + 1\n",
    "  print('Для числа {f1} найдено следующее кол-во делителей: {f2}'.format(f1=i,f2=k))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "19abf825",
   "metadata": {},
   "source": [
    "Задание_4. Найти 100 первых простых чисел."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "74a5f0db",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n",
      "3\n",
      "5\n",
      "7\n",
      "11\n",
      "13\n",
      "17\n",
      "19\n",
      "23\n",
      "29\n",
      "31\n",
      "37\n",
      "41\n",
      "43\n",
      "47\n",
      "53\n",
      "59\n",
      "61\n",
      "67\n",
      "71\n",
      "73\n",
      "79\n",
      "83\n",
      "89\n",
      "97\n",
      "101\n",
      "103\n",
      "107\n",
      "109\n",
      "113\n",
      "127\n",
      "131\n",
      "137\n",
      "139\n",
      "149\n",
      "151\n",
      "157\n",
      "163\n",
      "167\n",
      "173\n",
      "179\n",
      "181\n",
      "191\n",
      "193\n",
      "197\n",
      "199\n",
      "211\n",
      "223\n",
      "227\n",
      "229\n",
      "233\n",
      "239\n",
      "241\n",
      "251\n",
      "257\n",
      "263\n",
      "269\n",
      "271\n",
      "277\n",
      "281\n",
      "283\n",
      "293\n",
      "307\n",
      "311\n",
      "313\n",
      "317\n",
      "331\n",
      "337\n",
      "347\n",
      "349\n",
      "353\n",
      "359\n",
      "367\n",
      "373\n",
      "379\n",
      "383\n",
      "389\n",
      "397\n",
      "401\n",
      "409\n",
      "419\n",
      "421\n",
      "431\n",
      "433\n",
      "439\n",
      "443\n",
      "449\n",
      "457\n",
      "461\n",
      "463\n",
      "467\n",
      "479\n",
      "487\n",
      "491\n",
      "499\n",
      "503\n",
      "509\n",
      "521\n",
      "523\n",
      "541\n"
     ]
    }
   ],
   "source": [
    "m = 0\n",
    "for i in range(2, 1000):\n",
    "  k = 0\n",
    "  for j in range(2, i):\n",
    "    if i % j == 0:\n",
    "      k = k + 1\n",
    "  if k == 0:\n",
    "    print(i)\n",
    "    m += 1\n",
    "  if m == 100:\n",
    "    break"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
